// js 모듈은 다른 js 파일에서 이름 충돌이 없이 쉽게 불러서 활용할 수 있는 재사용 가능한 코드 조각을 말한다. js는 모듈을 한 모듈당
// 하나씩 별도의 파일로 저장한다. 모듈을 만들고 외부에 export하는 방법에는, 한 모듈에서 여러 js 객체를 외부에 노출시키는 방식(export)과
// 한 모듈에 하나의 js 객체를 노출시키는 방식(export default)이 있다.

// export나 export default에서는 기본 타입, 객체, 배열, 함수 등 모든 타입의 js 이름을 외부에 노출시킬 수 있다.

// import 명령을 사용해 다른 js 파일에 있는 모듈을 불러와 사용할 수 있다. 외부에 여러 이름을 노출한 모듈을 import할 때는
// 객체 구조 분해를 활용할 수 있다. export default를 사용해 한 이름만을 노출한 경우에는 노출된 대상을 한 이름으로 부를 수 있다.

// CommonJS는 모든 버전의 노드에서 지원하는 일반적인 모듈 패턴이다. CommonJS를 사용하면 module.exports를 사용해
// js 객체를 export할 수 있다. import 시에는 require 함수를 사용한다.